tests_integration_src_test_java_org_mule_test_integration_message_MessagePropertyInResponseTransformersTestCase.java/[CN]/MessagePropertyInResponseTransformersTestCase/[MT]/testSend()/body

{
  MuleClient client=muleContext.getClient();
  final String payload="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:sim=\"http://simple.component.mule.org/\"><soapenv:Header/><soapenv:Body><sim:echo><sim:echo>aaa</sim:echo></sim:echo></soapenv:Body></soapenv:Envelope>";
  MuleMessage result=client.send("http://localhost:63081/ser",new DefaultMuleMessage(payload,muleContext));
  assertEquals("<?xml version=\"1.0\" encoding=\"UTF-8\"?><root xmlns=\"http://simple.component.mule.org/\"><testval>bar</testval></root>",getPayloadAsString(result));
}
